GFRPG/app/controllers/games_controller.rb

SELECT "games".* FROM "games"
---
  def index
    @games = Game.all

INSERT INTO "games" ("created_at", "updated_at", "name", "description", "date", "mestre_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2018-12-04 03:14:33.572792"], ["updated_at", "2018-12-04 03:14:33.572792"], ["name", "fdsafasdfa"], ["description", "fsadfsadfa"], ["date", "2018-12-04 00:00:00"], ["mestre_id", 1]]
---
  def create
    @game = Game.new(game_params)
    #@game = Game.new(allowed_params)
    respond_to do |format|
      if @game.save

SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_game
      @game = Game.find(params[:id])