GFRPG/app/controllers/mestres_controller.rb

SELECT "mestres".* FROM "mestres"
---
  def index
    @mestres = Mestre.all

INSERT INTO "mestres" ("name", "secret", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "1"], ["secret", "123"], ["created_at", "2018-12-02 11:58:43.216458"], ["updated_at", "2018-12-02 11:58:43.216458"]]
---
  def create
    @mestre = Mestre.new(mestre_params)

    respond_to do |format|
      if @mestre.save

UPDATE "mestres" SET "secret" = ?, "updated_at" = ? WHERE "mestres"."id" = ?  [["secret", "14567"], ["updated_at", "2018-12-02 12:00:14.208662"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @mestre.update(mestre_params)

DELETE FROM "mestres" WHERE "mestres"."id" = ?  [["id", 2]]
---
  def destroy
    @mestre.destroy

SELECT  "mestres".* FROM "mestres" WHERE "mestres"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_mestre
      @mestre = Mestre.find(params[:id])