GFRPG/app/controllers/participations_controller.rb

SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def new
    @participation = Participation.new
    @game = Game.find(params[:game])