GFRPG/app/controllers/sessions_controller.rb

  def create
            @mestre = Mestre.find_by(name: params[:session][:name].downcase)
---
SELECT  "mestres".* FROM "mestres" WHERE "mestres"."name" = ? LIMIT ?  [["name", ""], ["LIMIT", 1]]