GFRPG/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "pass", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "jogador1"], ["pass", "123"], ["created_at", "2018-12-04 03:03:15.760024"], ["updated_at", "2018-12-04 03:03:15.760024"]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "pass" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["pass", "1234"], ["updated_at", "2018-12-04 02:45:29.338028"], ["id", 2]]